[
    [
        968,
        [
            "Field of Fractions",
            "For an integral domain $R$, the field of fractions $Q(R)$ is the set of equivalence classes of pairs $(a, b)$ where $a, b \\in R$ and $b \\neq 0$, under the equivalence relation defined by $(a, b) \\sim (a', b')$ if and only if $ab' = a'b$."
        ],
        [
            "Normal field extension",
            "A normal field extension is an extension field that is the splitting field of a family of polynomials from the base field. It is a prestage to Galois extensions. An algebraic field extension \\\\(K \\subset L\\\\) is called normal if it satisfies the equivalent conditions of Theorem 4: (i) Every \\\\(K\\\\)-homomorphism \\\\(L \\longrightarrow \\bar{L}\\\\) into an algebraic closure \\\\(\\bar{L}\\\\) of \\\\(L\\\\) restricts to an automorphism of \\\\(L\\\\). (ii) \\\\(L\\\\) is a splitting field of a family of polynomials in \\\\(K[X]\\\\). (iii) Every irreducible polynomial in \\\\(K[X]\\\\) that admits a zero in \\\\(L\\\\) decomposes over \\\\(L\\\\) completely into linear factors."
        ],
        "Does the concept of a/an Field of Fractions need to be defined for a definition of a/an Normal field extension to make sense? (True if the first concept is needed and False if is not.)"
    ],
    [
        [
            "Validity_Check",
            {
                "Explanation": "The concept of a Field of Fractions is specifically related to integral domains, providing a way to construct a field from any integral domain by considering ratios of its elements. This construction is crucial in algebraic structures where division by non-zero elements is not initially possible. On the other hand, a Normal field extension deals with properties of field extensions, particularly focusing on the behavior of polynomials and their roots within these extensions. The definition of a Normal field extension involves conditions related to field homomorphisms, splitting fields, and the factorization of polynomials, but it does not inherently require the concept of a Field of Fractions. The Field of Fractions is used to extend an integral domain to a field, which is a different context from examining the properties of an existing field extension. Therefore, the definition and understanding of a Normal field extension do not depend on the concept of a Field of Fractions.",
                "Verdict": false
            }
        ]
    ]
]