[
    [
        [
            0,
            4,
            "Commutative Law",
            "A law of composition on a set $M$ is commutative if $ab = ba$ for all elements $a, b \\in M$."
        ],
        [
            1,
            25,
            "Dedekind Domain",
            "A Dedekind domain is an integral domain in which the theorem on unique prime factorization holds for ideals. It is a nonzero ring without nontrivial zero divisors, and Dedekind's theorem on unique prime factorization for ideals is applicable."
        ],
        [
            2,
            33,
            "Field",
            "A field is a commutative division ring."
        ],
        [
            3,
            40,
            "Ideal",
            "Let $R$ be a ring. A subset $\\mathfrak{a} \\subset R$ is called an ideal in $R$ if: (i) $\\mathfrak{a}$ is an additive subgroup of $R$. (ii) For any $r \\in R$ and $a \\in \\mathfrak{a}$, it holds that $ra \\in \\mathfrak{a}$."
        ],
        [
            4,
            63,
            "Factorial ring/unique factorization domain",
            "An integral domain $R$ satisfying the conditions that every element $a \\in R-\\left(R^{*} \\cup\\{0\\}\\right)$ can be uniquely written, up to associatedness and order, as a product of irreducible elements, and every element $a \\in R-\\left(R^{*} \\cup\\{0\\}\\right)$ is a product of prime elements. An element of a unique factorization domain is irreducible if and only if it is prime."
        ],
        [
            5,
            69,
            "Irreducible Polynomial",
            "A polynomial $f$ in a ring $R[X]$ is irreducible if it cannot be factored into the product of two non-constant polynomials in $R[X]$."
        ],
        [
            6,
            86,
            "Kronecker's Construction",
            "Kronecker's construction defines an extension field by taking the quotient of the polynomial ring of the base field by the ideal generated by an irreducible polynomial. The residue class of the indeterminate in this quotient field is a zero of the polynomial, allowing the successive adjoining of zeros of polynomials to the base field."
        ],
        [
            7,
            100,
            "Ring Homomorphism of Finite Type",
            "A ring homomorphism $\\varphi: A \\longrightarrow B$ is of finite type if there exists an epimorphism $\\Phi: A[X_{1}, \\ldots, X_{n}] \\longrightarrow B$ from a polynomial ring in finitely many variables over $A$ to $B$ that extends $\\varphi$. Alternatively, it can be characterized by the existence of elements $x_{1}, \\ldots, x_{n} \\in B$ such that $B=\\varphi(A)[x_{1}, \\ldots, x_{n}]$."
        ],
        [
            8,
            117,
            "Algebraic subset",
            "An algebraic subset of \\(\\bar{K}^{n}\\) defined over \\(K\\) is the set of common zeros in \\(\\bar{K}^{n}\\) of the polynomials belonging to a subset \\(E\\) of the polynomial ring \\(K[X]=K\\left[X_{1}, \\ldots, X_{n}\\right]\\). It is denoted as \\(V(E)\\)."
        ],
        [
            9,
            123,
            "Galois extension",
            "An extension $K_{r} / K$ is Galois if it is both normal and separable."
        ],
        [
            10,
            133,
            "p-Sylow subgroup",
            "A subgroup H of a finite group G is called a p-Sylow subgroup if H is a p-group such that p does not divide the index (G: H). This means there exist integers k, m in N satisfying ord H=p^k, as well as ord G=p^k m, where p does not divide m."
        ]
    ],
    [
        [
            "Inheritance_Analysis",
            {
                "Generalization_Specialization_Relationships": [
                    {
                        "Generalization": 4,
                        "Specialization": 1,
                        "Explanation": "A Dedekind domain is a special case of a factorial ring (unique factorization domain) where the unique factorization property extends from elements to ideals."
                    },
                    {
                        "Generalization": 2,
                        "Specialization": 9,
                        "Explanation": "A Galois extension is a special case of a field, specifically referring to an extension field that is both normal and separable."
                    },
                    {
                        "Generalization": 2,
                        "Specialization": 6,
                        "Explanation": "Kronecker's construction results in an extension field, which is a special case of a field, by adjoining zeros of polynomials to the base field."
                    }
                ]
            }
        ]
    ]
]