[
    12,
    [
        [
            "Store_Definitions_Theorems",
            {
                "Definitions": [
                    {
                        "Concept_Name": "Minimal Polynomial",
                         "Definition_Content": "The minimal polynomial of an element \\\\(\\alpha\\\\) in a field extension is the monic polynomial of lowest degree in the base field that has \\\\(\\alpha\\\\) as a root. It is a prime polynomial and generates the kernel of the evaluation homomorphism from the polynomial ring of the base field to the field generated by \\\\(\\alpha\\\\). \n(Alt.2)\nLet $K \\subset L$ be a field extension and $\\alpha \\in L$ an element that is algebraic over $K$. The unique monic polynomial $f \\in K[X]$ of smallest degree such that $f(\\alpha)=0$ is called the minimal polynomial of $\\alpha$ over $K$."
                    },
                    {
                        "Concept_Name": "Galois Group of a Polynomial Splitting Fields",
                        "Definition_Content": "The Galois group of a polynomial equation is the group of automorphisms of the splitting field of the polynomial that fix the base field. These automorphisms permute the roots of the polynomial."
                    },
                    {
                        "Concept_Name": "Kronecker's Construction",
                        "Definition_Content": "Kronecker's construction defines an extension field by taking the quotient of the polynomial ring of the base field by the ideal generated by an irreducible polynomial. The residue class of the indeterminate in this quotient field is a zero of the polynomial, allowing the successive adjoining of zeros of polynomials to the base field."
                    },
                    {
                        "Concept_Name": "Separable Polynomial",
                        "Definition_Content": "A separable polynomial is a polynomial that has distinct roots in its splitting field, i.e., all roots are simple."
                    },
                    {
                        "Concept_Name": "Purely Inseparable Extension",
                        "Definition_Content": "A purely inseparable extension is a field extension where the minimal polynomial of any element in the extension has a single root, which is repeated according to the degree of the polynomial."
                    }
                ],
                "Theorems": [
                    {
                        "Theorem_Name": "Fundamental Theorem on Homomorphisms",
                        "Theorem_Content": "If there is a homomorphism from a ring \\\\(A\\\\) to a ring \\\\(B\\\\) with a kernel \\\\(I\\\\), then the quotient ring \\\\(A/I\\\\) is isomorphic to the image of \\\\(B\\\\) under the homomorphism."
                    },
                    {
                        "Theorem_Name": "Primitive Element Theorem",
                        "Theorem_Content": "There exists an element in a splitting field of a polynomial over a field such that the field generated by this element is the splitting field itself. This element is called a primitive element."
                    }
                ]
            }
        ]
    ]
]