[
    [
        [
            0,
            3,
            "Associative Law",
            "A law of composition on a set $M$ is said to be associative if $(ab)c = a(bc)$ for all elements $a, b, c \\in M$."
        ],
        [
            1,
            15,
            "Group Homomorphism",
            "Let $G, G^{\\'prime}$ be monoids with corresponding unit elements $e$ and $e^{\\'prime}$. A monoid homomorphism $\\varphi: G \\longrightarrow G^{\\'prime}$ is a map $\\varphi$ from $G$ to $G^{\\'prime}$ such that (i) $\\varphi(e)=e^{\\'prime}$, (ii) $\\varphi(a b)=\\varphi(a) \\varphi(b)$ for all $a, b \\in G$. Furthermore, if $G, G^{\\'prime}$ are groups, $\\varphi$ is called a group homomorphism."
        ],
        [
            2,
            29,
            "Subring",
            "A subset S of a ring R is called a subring if S is a subgroup with respect to the addition on R and a submonoid with respect to the multiplication on R. S inherits the laws of composition from R and is itself a ring."
        ],
        [
            3,
            51,
            "Ring Monomorphism",
            "A ring homomorphism $\\varphi: R \\longrightarrow R'$ is called a monomorphism if it is injective."
        ],
        [
            4,
            62,
            "Irreducible element",
            "Let $R$ be an integral domain and $p \\in R$ a nonzero nonunit. $p$ is called irreducible if a factorization of type $p=x y$ with $x, y \\in R$ implies $x \\in R^{*}$ or $y \\in R^{*}$. Furthermore, $p$ is called reducible if it is not irreducible."
        ],
        [
            5,
            66,
            "Field of Fractions",
            "For an integral domain $R$, the field of fractions $Q(R)$ is the set of equivalence classes of pairs $(a, b)$ where $a, b \\in R$ and $b \\neq 0$, under the equivalence relation defined by $(a, b) \\sim (a', b')$ if and only if $ab' = a'b$."
        ],
        [
            6,
            86,
            "Kronecker's Construction",
            "Kronecker's construction defines an extension field by taking the quotient of the polynomial ring of the base field by the ideal generated by an irreducible polynomial. The residue class of the indeterminate in this quotient field is a zero of the polynomial, allowing the successive adjoining of zeros of polynomials to the base field."
        ],
        [
            7,
            104,
            "Algebraically closed field",
            "A field $K$ is called algebraically closed if every nonconstant polynomial $f$ of $K[X]$ admits a zero in $K$, or in other words, if $f$ decomposes in $K[X]$ into a product of linear factors. This means that $f$ admits a product decomposition $f=c \\prod_{i}\\left(X-\\alpha_{i}\\right)$ with a constant $c \\in K^{*}$ as well as zeros $\\alpha_{i} \\in K$."
        ],
        [
            8,
            111,
            "Prime Subfield of a Finite Field",
            "The prime subfield of a finite field $\\\\[\\mathbb{F}\\]$ is the smallest subfield contained within $\\\\[\\mathbb{F}\\]$, denoted as $\\\\[\\mathbb{F}_p\\]$, where $p=\\operatorname{char} \\\\[\\mathbb{F}\\]>0$."
        ],
        [
            9,
            128,
            "Stabilizer",
            "Let $G \\times X \\longrightarrow X$ be an action of a group $G$ on a set $X$. The stabilizer or isotropy subgroup of a point $x \\in X$ is defined as $G_{x}:=\\{g \\in G ; g x=x\\}$."
        ],
        [
            10,
            139,
            "Sign or Signature of a Permutation",
            "The sign or signature of a permutation $\\pi \\in \\mathfrak{S}_{n}$, denoted as $\\operatorname{sgn} \\pi$, is defined by the product $\\prod_{i<j} \\frac{\\pi(i)-\\pi(j)}{i-j}$. The sign can only assume the values 1 and -1. If $\\operatorname{sgn} \\pi$ is positive, $\\pi$ is called an even permutation, and an odd permutation otherwise."
        ],
        [
            11,
            148,
            "Codomain",
            "The codomain of a function is the set that contains all potential output values, even if some of those values are not actually produced by any input in the domain."
        ]
    ],
    [
        [
            "Definition_Association_Analysis",
            {
                "Implied_Association_Relationships": [
                    {
                        "Explanation": "A group homomorphism is defined in terms of monoids, which are associative structures. Therefore, the concept of associativity is necessary to define a group homomorphism.",
                        "The_Definition_of_This_Concept": 1,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "A subring is defined as a submonoid with respect to multiplication, and monoids are associative structures. Therefore, the concept of associativity is necessary to define a subring.",
                        "The_Definition_of_This_Concept": 2,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "A ring monomorphism is a specific type of ring homomorphism, which in turn is defined in terms of rings. Rings are associative structures with respect to both addition and multiplication. Therefore, the concept of associativity is necessary to define a ring monomorphism.",
                        "The_Definition_of_This_Concept": 3,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "The field of fractions is defined for an integral domain, which is a type of ring. Rings are associative structures with respect to both addition and multiplication. Therefore, the concept of associativity is necessary to define the field of fractions.",
                        "The_Definition_of_This_Concept": 5,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "Kronecker's construction involves the polynomial ring of a base field. Polynomial rings are associative structures. Therefore, the concept of associativity is necessary to define Kronecker's construction.",
                        "The_Definition_of_This_Concept": 6,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "An algebraically closed field is defined in terms of polynomials, which are elements of polynomial rings. Polynomial rings are associative structures. Therefore, the concept of associativity is necessary to define an algebraically closed field.",
                        "The_Definition_of_This_Concept": 7,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "The prime subfield of a finite field is a subfield, and fields are associative structures with respect to both addition and multiplication. Therefore, the concept of associativity is necessary to define the prime subfield of a finite field.",
                        "The_Definition_of_This_Concept": 8,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "The stabilizer is defined in terms of a group action, and groups are associative structures. Therefore, the concept of associativity is necessary to define the stabilizer.",
                        "The_Definition_of_This_Concept": 9,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "The sign or signature of a permutation is defined in terms of permutations, which are elements of the symmetric group. Groups are associative structures. Therefore, the concept of associativity is necessary to define the sign or signature of a permutation.",
                        "The_Definition_of_This_Concept": 10,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "A ring monomorphism is a specific type of ring homomorphism, which is a map between rings. Therefore, the concept of a ring is necessary to define a ring monomorphism.",
                        "The_Definition_of_This_Concept": 3,
                        "Depends_On_This_Concept": 2
                    },
                    {
                        "Explanation": "An irreducible element is defined in the context of an integral domain, which is a type of ring. Therefore, the concept of a ring is necessary to define an irreducible element.",
                        "The_Definition_of_This_Concept": 4,
                        "Depends_On_This_Concept": 2
                    },
                    {
                        "Explanation": "The field of fractions is defined for an integral domain, which is a type of ring. Therefore, the concept of a ring is necessary to define the field of fractions.",
                        "The_Definition_of_This_Concept": 5,
                        "Depends_On_This_Concept": 2
                    },
                    {
                        "Explanation": "Kronecker's construction involves the polynomial ring of a base field. Polynomial rings are defined in terms of rings. Therefore, the concept of a ring is necessary to define Kronecker's construction.",
                        "The_Definition_of_This_Concept": 6,
                        "Depends_On_This_Concept": 2
                    },
                    {
                        "Explanation": "An algebraically closed field is defined in terms of polynomials, which are elements of polynomial rings. Polynomial rings are defined in terms of rings. Therefore, the concept of a ring is necessary to define an algebraically closed field.",
                        "The_Definition_of_This_Concept": 7,
                        "Depends_On_This_Concept": 2
                    },
                    {
                        "Explanation": "The prime subfield of a finite field is a subfield, and fields are defined in terms of rings. Therefore, the concept of a ring is necessary to define the prime subfield of a finite field.",
                        "The_Definition_of_This_Concept": 8,
                        "Depends_On_This_Concept": 2
                    }
                ]
            }
        ]
    ]
]