[
    [
        [
            0,
            79,
            "Free A-module",
            "An A-module M is called a free A-module if it has a basis, i.e., a free system of generators. In this case, every element x in M admits a representation x = sum_{i in I} a_i x_i with coefficients a_i in A that are unique."
        ],
        [
            1,
            80,
            "Torsion element",
            "An element x of an A-module M is called a torsion element if there exists an element a in A-{0} such that a.x = 0."
        ],
        [
            2,
            81,
            "Torsion submodule",
            "The torsion submodule T of an A-module M consists of all torsion elements of M. If T = 0, M is called torsion-free; if T = M, it is called a torsion module."
        ],
        [
            3,
            82,
            "Rank of an A-module",
            "The rank of an A-module M is defined as the supremum of all numbers n such that there exists a linearly independent system of elements x_1, ..., x_n in M."
        ],
        [
            4,
            83,
            "Length of an A-module",
            "The length l_A(M) of an A-module M is defined as the supremum of all numbers l such that there is a chain of submodules 0 subsetneq M_1 subsetneq M_2 subsetneq ... subsetneq M_l = M of length l."
        ],
        [
            5,
            84,
            "Minimal Polynomial",
            "The minimal polynomial of an element \\\\(\\alpha\\\\) in a field extension is the monic polynomial of lowest degree in the base field that has \\\\(\\alpha\\\\) as a root. It is a prime polynomial and generates the kernel of the evaluation homomorphism from the polynomial ring of the base field to the field generated by \\\\(\\alpha\\\\). \n(Alt.2)\nLet $K \\subset L$ be a field extension and $\\alpha \\in L$ an element that is algebraic over $K$. The unique monic polynomial $f \\in K[X]$ of smallest degree such that $f(\\alpha)=0$ is called the minimal polynomial of $\\alpha$ over $K$."
        ],
        [
            6,
            85,
            "Galois Group of a Polynomial Splitting Fields",
            "The Galois group of a polynomial equation is the group of automorphisms of the splitting field of the polynomial that fix the base field. These automorphisms permute the roots of the polynomial."
        ],
        [
            7,
            86,
            "Kronecker's Construction",
            "Kronecker's construction defines an extension field by taking the quotient of the polynomial ring of the base field by the ideal generated by an irreducible polynomial. The residue class of the indeterminate in this quotient field is a zero of the polynomial, allowing the successive adjoining of zeros of polynomials to the base field."
        ],
        [
            8,
            87,
            "Separable Polynomial",
            "A separable polynomial is a polynomial that has distinct roots in its splitting field, i.e., all roots are simple."
        ],
        [
            9,
            88,
            "Purely Inseparable Extension",
            "A purely inseparable extension is a field extension where the minimal polynomial of any element in the extension has a single root, which is repeated according to the degree of the polynomial."
        ],
        [
            10,
            89,
            "Characteristic of a field",
            "Let $K$ be a field (or, more generally, an integral domain) and let $\\varphi: \\mathbb{Z} \\longrightarrow K$ be the canonical ring homomorphism. Furthermore, let $p \\in \\mathbb{N}$ be a generating element of the principal ideal $\\operatorname{ker} \\varphi$. Then $p$ is called the characteristic of $K$, and we write $p=\\operatorname{char} K$."
        ],
        [
            11,
            90,
            "Subfield",
            "A subring $T$ of a field $K$ is called a subfield if $T$ is a field itself."
        ],
        [
            12,
            91,
            "Prime subfield of a Field",
            "The unique smallest subfield $P$ of a field $K$, given by the intersection of all subfields in $K$, is referred to as the prime (sub)field in $K$."
        ]
    ],
    [
        [
            "Definition_Association_Analysis",
            {
                "Implied_Association_Relationships": [
                    {
                        "Explanation": "A torsion submodule is defined as the set of all torsion elements in an A-module. Therefore, the concept of a torsion element must be defined to understand what constitutes a torsion submodule.",
                        "The_Definition_of_This_Concept": 2,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "The rank of an A-module is defined in terms of a linearly independent system of elements in the module. Therefore, the concept of an A-module must be defined to understand the rank of an A-module.",
                        "The_Definition_of_This_Concept": 3,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "The length of an A-module is defined in terms of chains of submodules. Therefore, the concept of an A-module must be defined to understand the length of an A-module.",
                        "The_Definition_of_This_Concept": 4,
                        "Depends_On_This_Concept": 0
                    },
                    {
                        "Explanation": "The minimal polynomial of an element in a field extension is defined in terms of polynomials in the base field. Therefore, the concept of a field must be defined to understand the minimal polynomial.",
                        "The_Definition_of_This_Concept": 5,
                        "Depends_On_This_Concept": 10
                    },
                    {
                        "Explanation": "The Galois group of a polynomial is defined in terms of automorphisms of the splitting field of the polynomial that fix the base field. Therefore, the concept of a field must be defined to understand the Galois group of a polynomial.",
                        "The_Definition_of_This_Concept": 6,
                        "Depends_On_This_Concept": 10
                    },
                    {
                        "Explanation": "Kronecker's construction defines an extension field by taking the quotient of the polynomial ring of the base field by the ideal generated by an irreducible polynomial. Therefore, the concept of a field must be defined to understand Kronecker's construction.",
                        "The_Definition_of_This_Concept": 7,
                        "Depends_On_This_Concept": 10
                    },
                    {
                        "Explanation": "A separable polynomial is defined as a polynomial that has distinct roots in its splitting field. Therefore, the concept of a field must be defined to understand a separable polynomial.",
                        "The_Definition_of_This_Concept": 8,
                        "Depends_On_This_Concept": 10
                    },
                    {
                        "Explanation": "A purely inseparable extension is a field extension where the minimal polynomial of any element in the extension has a single root. Therefore, the concept of a field must be defined to understand a purely inseparable extension.",
                        "The_Definition_of_This_Concept": 9,
                        "Depends_On_This_Concept": 10
                    },
                    {
                        "Explanation": "A subfield is defined as a subring of a field that is itself a field. Therefore, the concept of a field must be defined to understand a subfield.",
                        "The_Definition_of_This_Concept": 11,
                        "Depends_On_This_Concept": 10
                    },
                    {
                        "Explanation": "The prime subfield of a field is defined as the unique smallest subfield of a field. Therefore, the concept of a field must be defined to understand the prime subfield of a field.",
                        "The_Definition_of_This_Concept": 12,
                        "Depends_On_This_Concept": 10
                    }
                ]
            }
        ]
    ]
]