[
    [
        [
            0,
            13,
            "Subgroup",
            "Let $G$ be a monoid. A subset $H \\subset G$ is called a submonoid if $H$ satisfies the following conditions: (i) $e \\in H$, (ii) $a, b \\in H \\Longrightarrow a b \\in H$. If $G$ is a group, $H$ is called a subgroup of $G$ if in addition, (iii) $a \\in H \\Longrightarrow a^{-1} \\in H$. In particular, a subgroup of a group $G$ is a submonoid that is closed under the process of taking inverses. In defining a subgroup $H \\subset G$, condition (i) can be weakened by simply requiring $H \\neq \\emptyset$, since this implies $e \\in H$ using (ii) and (iii). Of course, similar reasoning is not possible for monoids. Every group $G$ admits $\\{e\\}$ and $G$ as trivial subgroups. Given $m \\in \\mathbb{Z}$, the set $m \\mathbb{Z}$ consisting of all integral multiples of $m$ is a subgroup of the additive group $\\mathbb{Z}$. We will see in 1.3/4 that all subgroups of $\\mathbb{Z}$ are of this type. More generally, every element $a$ of a group $G$ gives rise to a so-called cyclic subgroup of $G$. It consists of all powers $a^{n}, n \\in \\mathbb{Z}$, where we put $a^{n}=\\left(a^{-1}\\right)^{-n}$ for $n<0; see also Section 1.3."
        ],
        [
            1,
            26,
            "Ring",
            "A ring (admitting a unit element) is a set R together with two laws of composition written as addition '+' and multiplication '.' such that: (i) R is a commutative group with respect to addition. (ii) R is a monoid with respect to multiplication, i.e., the multiplication is associative, and there exists a unit element in R. (iii) The distributive laws hold, i.e., (a+b) \ncdot c=a \ncdot c+b \ncdot c, and c \ncdot(a+b)=c \ncdot a+c \ncdot b for all a, b, c in R."
        ],
        [
            2,
            32,
            "Division Ring",
            "A ring R is called a division ring or a skew field if R is not the zero ring and every nonzero element of R is a unit (R* = R - {0})."
        ],
        [
            3,
            47,
            "Finitely Generated Ideal",
            "An ideal $\\mathfrak{a}$ in a ring $R$ is finitely generated if it admits a finite system of generators."
        ],
        [
            4,
            61,
            "Euclidean function",
            "The map $\\delta$ in a Euclidean domain $R$ that facilitates the Euclidean division process."
        ],
        [
            5,
            72,
            "A-module",
            "An A-module is an abelian group M, together with an exterior multiplication A x M -> M, (a, x) -> a.x that satisfies the vector space axioms: a.(x+y) = a.x + a.y, (a+b).x = a.x + b.x, a.(b.x) = (ab).x, 1.x = x for elements a, b in A, x, y in M."
        ],
        [
            6,
            88,
            "Purely Inseparable Extension",
            "A purely inseparable extension is a field extension where the minimal polynomial of any element in the extension has a single root, which is repeated according to the degree of the polynomial."
        ],
        [
            7,
            92,
            "Frobenius homomorphism",
            "For a field $K$ of characteristic $p>0$, the map $\\sigma: K \\longrightarrow K, \\quad a \\longmapsto a^{p}$, which respects the addition on $K$, defines a homomorphism of fields known as the Frobenius homomorphism of $K$."
        ],
        [
            8,
            108,
            "Splitting field of Family of Polynomials",
            "A splitting field of a family of nonconstant polynomials \\\\(\\mathfrak{F}=(f_i)_{i \\in I}, f_i \\in K[X]\\\\) over a field \\\\(K\\\\) is a field \\\\(L\\\\) extending \\\\(K\\\\) such that: (i) Every polynomial \\\\(f_i\\\\) decomposes into a product of linear factors over \\\\(L\\\\). (ii) The extension \\\\(L / K\\\\) is generated by the zeros of the polynomials \\\\(f_i\\\\)."
        ],
        [
            9,
            119,
            "Noetherian ring",
            "A ring \\(R\\) is called Noetherian if every ascending chain of ideals \\(\\mathfrak{a}_{1} \\subset \\mathfrak{a}_{2} \\subset \\ldots \\subset R\\) becomes stationary after finitely many steps, or equivalently, every ideal of \\(R\\) is finitely generated."
        ],
        [
            10,
            133,
            "p-Sylow subgroup",
            "A subgroup H of a finite group G is called a p-Sylow subgroup if H is a p-group such that p does not divide the index (G: H). This means there exist integers k, m in N satisfying ord H=p^k, as well as ord G=p^k m, where p does not divide m."
        ],
        [
            11,
            148,
            "Codomain",
            "The codomain of a function is the set that contains all potential output values, even if some of those values are not actually produced by any input in the domain."
        ]
    ],
    [
        [
            "Definition_Association_Analysis",
            {
                "Implied_Association_Relationships": [
                    {
                        "Explanation": "A subgroup is defined as a subset of a group that satisfies certain conditions. Therefore, the concept of a group must be defined to understand what a subgroup is.",
                        "The_Definition_of_This_Concept": 0,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "A division ring is a specific type of ring where every nonzero element is a unit. Therefore, the concept of a ring must be defined to understand what a division ring is.",
                        "The_Definition_of_This_Concept": 2,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "An ideal is a subset of a ring that satisfies certain properties. Therefore, the concept of a ring must be defined to understand what an ideal is, and by extension, what a finitely generated ideal is.",
                        "The_Definition_of_This_Concept": 3,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "A Euclidean function is defined in the context of a Euclidean domain, which is a specific type of ring. Therefore, the concept of a ring must be defined to understand what a Euclidean domain and its Euclidean function are.",
                        "The_Definition_of_This_Concept": 4,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "An A-module is an abelian group with an additional structure defined by an exterior multiplication with elements from a ring A. Therefore, the concept of a ring must be defined to understand what an A-module is.",
                        "The_Definition_of_This_Concept": 5,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "A purely inseparable extension is a type of field extension. Therefore, the concept of a field must be defined to understand what a purely inseparable extension is.",
                        "The_Definition_of_This_Concept": 6,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "The Frobenius homomorphism is a map defined for fields of characteristic p>0. Therefore, the concept of a field must be defined to understand what the Frobenius homomorphism is.",
                        "The_Definition_of_This_Concept": 7,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "A splitting field is a field extension that satisfies certain properties with respect to a family of polynomials. Therefore, the concept of a field must be defined to understand what a splitting field is.",
                        "The_Definition_of_This_Concept": 8,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "A Noetherian ring is a specific type of ring where every ideal is finitely generated. Therefore, the concept of a ring must be defined to understand what a Noetherian ring is.",
                        "The_Definition_of_This_Concept": 9,
                        "Depends_On_This_Concept": 1
                    },
                    {
                        "Explanation": "A p-Sylow subgroup is a specific type of subgroup of a finite group. Therefore, the concept of a subgroup must be defined to understand what a p-Sylow subgroup is.",
                        "The_Definition_of_This_Concept": 10,
                        "Depends_On_This_Concept": 0
                    }
                ]
            }
        ]
    ]
]