[
    [
        [
            0,
            10,
            "Inverse of an Element",
            "In a monoid $M$, an element $b \\in M$ is called an inverse of a given element $a \\in M$ if $ab = e = ba$. The element $b$, if it exists, is uniquely determined by $a$ and is denoted by $a^{-1}$."
        ],
        [
            1,
            23,
            "Order of an element",
            "The order of an element $a$ in a group $G$ is defined as the order of the cyclic group generated by $a$ in $G$. It is the smallest positive integer $m$ such that $a^{m}=1$."
        ],
        [
            2,
            34,
            "Zero Divisor",
            "An element a of a ring R is called a zero divisor if there exists an element b in R - {0} such that ab=0 or ba=0. Fields and skew fields do not admit any zero divisors, except for 0, the trivial zero divisor."
        ],
        [
            3,
            42,
            "Sum of Ideals",
            "For ideals $\\mathfrak{a}, \\mathfrak{b}$ in a ring $R$, the sum $\\mathfrak{a}+\\mathfrak{b}$ is defined as $\\{a+b ; a \\in \\mathfrak{a}, b \\in \\mathfrak{b}\\}$."
        ],
        [
            4,
            59,
            "Maximal Ideal",
            "A proper ideal $\\mathfrak{m} \\subsetneq R$ in a ring $R$ is called a maximal ideal if for any ideal $\\mathfrak{a} \\subset R$ that contains $\\mathfrak{m}$, $\\mathfrak{a}$ must be either $\\mathfrak{m}$ or $R$."
        ],
        [
            5,
            77,
            "Finitely generated module",
            "An A-module M is said to be finitely generated if it admits a finite system of generators. It is also referred to as a finite A-module."
        ],
        [
            6,
            89,
            "Characteristic of a field",
            "Let $K$ be a field (or, more generally, an integral domain) and let $\\varphi: \\mathbb{Z} \\longrightarrow K$ be the canonical ring homomorphism. Furthermore, let $p \\in \\mathbb{N}$ be a generating element of the principal ideal $\\operatorname{ker} \\varphi$. Then $p$ is called the characteristic of $K$, and we write $p=\\operatorname{char} K$."
        ],
        [
            7,
            92,
            "Frobenius homomorphism",
            "For a field $K$ of characteristic $p>0$, the map $\\sigma: K \\longrightarrow K, \\quad a \\longmapsto a^{p}$, which respects the addition on $K$, defines a homomorphism of fields known as the Frobenius homomorphism of $K$."
        ],
        [
            8,
            117,
            "Algebraic subset",
            "An algebraic subset of \\(\\bar{K}^{n}\\) defined over \\(K\\) is the set of common zeros in \\(\\bar{K}^{n}\\) of the polynomials belonging to a subset \\(E\\) of the polynomial ring \\(K[X]=K\\left[X_{1}, \\ldots, X_{n}\\right]\\). It is denoted as \\(V(E)\\)."
        ],
        [
            9,
            122,
            "Separable extension",
            "An extension $L / K$ is called separable if it does not contain any inseparable algebraic elements over $K$."
        ],
        [
            10,
            139,
            "Sign or Signature of a Permutation",
            "The sign or signature of a permutation $\\pi \\in \\mathfrak{S}_{n}$, denoted as $\\operatorname{sgn} \\pi$, is defined by the product $\\prod_{i<j} \\frac{\\pi(i)-\\pi(j)}{i-j}$. The sign can only assume the values 1 and -1. If $\\operatorname{sgn} \\pi$ is positive, $\\pi$ is called an even permutation, and an odd permutation otherwise."
        ],
        [
            11,
            147,
            "Domain",
            "The domain of a function is the set of all possible input values for which the function is defined. Every input value in the domain has a corresponding output in the codomain via the function."
        ]
    ],
    [
        [
            "Definition_Association_Analysis",
            {
                "Implied_Association_Relationships": [
                    {
                        "Explanation": "A monoid is a set equipped with an associative binary operation and an identity element. The definition of an inverse of an element relies on the existence of an identity element in the monoid.",
                        "The_Definition_of_This_Concept": 0,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "The order of an element in a group is defined in terms of the cyclic group generated by that element. Therefore, the concept of a group must be defined first.",
                        "The_Definition_of_This_Concept": 1,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "A zero divisor is defined in the context of a ring, which is a set equipped with two binary operations (addition and multiplication) satisfying certain axioms.",
                        "The_Definition_of_This_Concept": 2,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "The sum of ideals is defined in the context of a ring, which is a set equipped with two binary operations (addition and multiplication) satisfying certain axioms.",
                        "The_Definition_of_This_Concept": 3,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "A maximal ideal is defined in the context of a ring, which is a set equipped with two binary operations (addition and multiplication) satisfying certain axioms.",
                        "The_Definition_of_This_Concept": 4,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "A finitely generated module is defined in the context of a module over a ring, which is a set equipped with two binary operations (addition and multiplication) satisfying certain axioms.",
                        "The_Definition_of_This_Concept": 5,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "The characteristic of a field is defined in the context of a field, which is a set equipped with two binary operations (addition and multiplication) satisfying certain axioms.",
                        "The_Definition_of_This_Concept": 6,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "The Frobenius homomorphism is defined for a field of characteristic p>0. Therefore, the concept of the characteristic of a field must be defined first.",
                        "The_Definition_of_This_Concept": 7,
                        "Depends_On_This_Concept": 6
                    },
                    {
                        "Explanation": "An algebraic subset is defined in the context of a polynomial ring over a field. Therefore, the concept of a field must be defined first.",
                        "The_Definition_of_This_Concept": 8,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "A separable extension is defined in the context of field extensions. Therefore, the concept of a field must be defined first.",
                        "The_Definition_of_This_Concept": 9,
                        "Depends_On_This_Concept": 11
                    },
                    {
                        "Explanation": "The sign or signature of a permutation is defined in the context of permutations, which are bijective functions. Therefore, the concept of a function must be defined first.",
                        "The_Definition_of_This_Concept": 10,
                        "Depends_On_This_Concept": 11
                    }
                ]
            }
        ]
    ]
]